app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "fff"], ["measurement_unit", "3"], ["price", 23], ["quantity", 2], ["created_at", "2022-12-15 04:52:42.437479"], ["updated_at", "2022-12-15 04:52:42.437479"], ["user_id", 1]]
---
  def create
    @food = Food.new(food_params)
    @food.user = current_user

    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @food = Food.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
---
  def destroy
    @food = Food.find(params[:id])
    @food.destroy