app/controllers/public_recipes_controller.rb

SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]
---
  def find_price
    price = 0
    recipe = Recipe.first