app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."updated_at" DESC
---
  def index
    @recipes = Recipe.all

INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipes = Recipe.new(recipe_params)
    @recipes.user_id = current_user.id
    if @recipes.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 ORDER BY "recipes"."updated_at" DESC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    data = Recipe.where(id: params[:id])

UPDATE "recipes" SET "description" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["description", "Making it work miracle"], ["updated_at", "2022-12-14 19:09:23.659820"], ["id", 5]]
---
  def update
    # @user = User.find(params[:id])
    if @recipes.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 12]]
---
  def destroy
    # @receipt = Recipe.find(params[:id])
    @recipes.destroy

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 ORDER BY "recipes"."updated_at" DESC LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def set_recipe
    @recipes = Recipe.find(params[:id])